#0 3.0//2.0  //向下取整
print(3.0//2.0) #1.0
#1  a>b>c  ==   a>b and b<c
#2  5**-2  ==   5**(-2)   5的-2次方  = 1/(5的2次方) = 1/25 = 0.04
#   -5**2  ==   -(5**2)  = -25
print(5**-2)  #0.04
print(-5**2)  #-25

#4
print('not 1 or 0 and 1 or 3 and 4 or 5 and 6 or 7 and 8 and 9 = ',end='')
print(not 1 or 0 and 1 or 3 and 4 or 5 and 6 or 7 and 8 and 9)
   #False       0         4           6             9
print('原理为')
print('1 and 2 = 2')
print('4 or 5  = 4')

#5 打印一个0-100的所有奇数
print('打印一个0-100的所有奇数')
i = 0
while(i<=100):
    if(i % 2 == 1):
        print(i,end=' ')
    i+=1

#6  有一个长阶梯，每步上2阶，最后剩1阶；每步上3阶，最后剩2阶；每步上5阶，最后剩4阶；每步上6阶，最后剩5阶；每步上7阶，正好；
print('\n有一个长阶梯，每步上2阶，最后剩1阶；每步上3阶，最后剩2阶；每步上5阶，最后剩4阶；每步上6阶，最后剩5阶；每步上7阶，正好；')
i = 7
while(i % 7 == 0 ):
    if(i % 2 ==1):
        if(i % 3 == 2):
            if(i % 5 == 4):
                if(i % 6 == 5):
                    print(i)
                    break
    i+=14